peng-zhihui/L-ink_Card/DAP-Link/Firmware/src/source/hic_hal/nxp/lpc4322/lpc43xx_cgu.c
#define CGU_CGU_ADDR	((uint32_t)LPC_CGU)
#define CGU_REG_BASE_CTRL(x) (*(uint32_t*)(CGU_CGU_ADDR+CGU_Entity_ControlReg_Offset[CGU_PERIPHERAL_Info[x].RegBaseEntity]))
#define CGU_REG_BRANCH_CTRL(x) (*(uint32_t*)(CGU_CGU_ADDR+CGU_PERIPHERAL_Info[x].RegBranchOffset))
#define CGU_REG_BRANCH_STATUS(x) (*(volatile uint32_t*)(CGU_CGU_ADDR+CGU_PERIPHERAL_Info[x].RegBranchOffset+4))

#define CGU_PER_BASE_CTRL(x) (*(uint32_t*)(CGU_CGU_ADDR+CGU_Entity_ControlReg_Offset[CGU_PERIPHERAL_Info[x].PerBaseEntity]))
#define CGU_PER_BRANCH_CTRL(x) (*(uint32_t*)(CGU_CGU_ADDR+CGU_PERIPHERAL_Info[x].PerBranchOffset))
#define CGU_PER_BRANCH_STATUS(x) (*(volatile uint32_t*)(CGU_CGU_ADDR+CGU_PERIPHERAL_Info[x].PerBranchOffset+4))

/**************************************************************************//**
 *
 * @brief Rough approximation of a delay function with microsecond resolution.
 *
 * Used during initial clock setup as the Timers are not configured yet.
 *
 * @param [in] us  The number of microseconds to wait
 *
 *****************************************************************************/
static void cgu_WaitUS(volatile uint32_t us)
{
    us *= (SystemCoreClock / 1000000) / 3;

    while (us--);
}

/**************************************************************************//**
 *
 * @brief Simple lookup of best MSEL and NSEL values for wanted frequency
 *
 * Not optimized.
 *
 * @param [in]  wantedFreq  The wanted PLL1 frequency
 * @param [out] pMsel       The best MSEL value for the PLL1_CTRL register
 * @param [out] pNsel       The best NSEL value for the PLL1_CTRL register
 *
 *****************************************************************************/
static void cgu_findMN(uint32_t wantedFreq, uint32_t *pMsel, uint32_t *pNsel)
{
    uint32_t besterr = wantedFreq;
    uint32_t m, n, f, tmp, err;
#define ABSDIFF(__a, __b) ( ((__a) < (__b)) ? ((__b) - (__a)) : ((__a) - (__b)) )

    for (n = 1; n <= 4; n++) {
        f = 12000000 / n;
        tmp = 0;

        for (m = 1; m <= 256; m++) {
            tmp += f;
            err = ABSDIFF(tmp, wantedFreq);

            if (err == 0) {
                // found perfect match
                *pMsel = m - 1;
                *pNsel = n - 1;
                return;

            } else if (err < besterr) {
                *pMsel = m - 1;
                *pNsel = n - 1;
                besterr = err;
            }

            if (tmp > wantedFreq) {
                // no point in continuing to increase tmp as value is too high already
                break;
            }
        }
    }
}

/*********************************************************************//**
 * @brief		Initialize default clock for LPC4300 Eval board
 * @param[in]	None
 * @return 		Initialize status, could be:
 * 					- CGU_ERROR_SUCCESS: successful
 * 					- Other: error
 **********************************************************************/
uint32_t	CGU_Init(uint32_t wantedFreq)
{
    uint32_t msel = 0;
    uint32_t nsel = 0;
    uint32_t tmp;
    // Setup PLL1 to 204MHz
    // 0. Select IRC as BASE_M4_CLK source
    CGU_EntityConnect(CGU_CLKSRC_IRC, CGU_BASE_M4);
    SystemCoreClock = 96000000;
    // 1. Enable the crystal oscillator
    CGU_SetXTALOSC(12000000);
    CGU_EnableEntity(CGU_CLKSRC_XTAL_OSC, ENABLE);
    // 2. Wait 250us
    cgu_WaitUS(250);
    // 3. Reconfigure PLL1 as follows:
    //    - Select the M and N divider values to produce the final desired
    //      PLL1 output frequency (204MHz => M=17,N=1 => msel=16,nsel=0)
    //    - Select the crystal oscillator as clock source for PLL1
    cgu_findMN(wantedFreq, &msel, &nsel);
    tmp = LPC_CGU->PLL1_CTRL & ~((0xFF << 16) | (0x03 << 12));
    LPC_CGU->PLL1_CTRL = tmp | (msel << 16) | (nsel << 12);
    CGU_EntityConnect(CGU_CLKSRC_XTAL_OSC, CGU_CLKSRC_PLL1);

    // 4. Wait for the PLL1 to lock
    while ((LPC_CGU->PLL1_STAT & 1) == 0x0);

    // 5. Set PLL1 P-divider to divide by 2 (DIRECT=0 and PSEL=0)
    LPC_CGU->PLL1_CTRL &= ~((0x03 << 8) | CGU_PLL1_DIRECT_MASK);
    // 6. Select PLL1 as BASE_M4_CLK source. The BASE_M4_CLK now operates at
    //    the mid frequency range
    CGU_EntityConnect(CGU_CLKSRC_PLL1, CGU_BASE_M4);
    SystemCoreClock = (12000000 * (msel + 1)) / ((nsel + 1) * 2);
    // 7. Wait 20us
    cgu_WaitUS(20);
    // 8. Set PLL P-divider to direct output mode (DIRECT=1)
    LPC_CGU->PLL1_CTRL |= CGU_PLL1_DIRECT_MASK;
    // The BASE_M4_CLK now operates in the high frequency range
    CGU_UpdateClock();
    SystemCoreClock = (12000000 * (msel + 1)) / (nsel + 1);
    return 0;
}

/*********************************************************************//**
 * @brief		Configure power for individual peripheral
 * @param[in]	PPType	peripheral type, should be:
 * 					- CGU_PERIPHERAL_ADC0		:ADC0
 * 					- CGU_PERIPHERAL_ADC1		:ADC1
 * 					- CGU_PERIPHERAL_AES		:AES
 * 					- CGU_PERIPHERAL_APB1_BUS	:APB1 bus
 * 					- CGU_PERIPHERAL_APB3_BUS	:APB3 bus
 * 					- CGU_PERIPHERAL_CAN		:CAN
 * 					- CGU_PERIPHERAL_CREG		:CREG
 * 					- CGU_PERIPHERAL_DAC		:DAC
 * 					- CGU_PERIPHERAL_DMA		:DMA
 * 					- CGU_PERIPHERAL_EMC		:EMC
 * 					- CGU_PERIPHERAL_ETHERNET	:ETHERNET
 * 					- CGU_PERIPHERAL_GPIO		:GPIO
 * 					- CGU_PERIPHERAL_I2C0		:I2C0
 * 					- CGU_PERIPHERAL_I2C1		:I2C1
 * 					- CGU_PERIPHERAL_I2S		:I2S
 * 					- CGU_PERIPHERAL_LCD		:LCD
 * 					- CGU_PERIPHERAL_M3CORE		:M3 core
 * 					- CGU_PERIPHERAL_M3_BUS		:M3 bus
 * 					- CGU_PERIPHERAL_MOTOCON	:Motor control
 * 					- CGU_PERIPHERAL_QEI		:QEI
 * 					- CGU_PERIPHERAL_RITIMER	:RIT timer
 * 					- CGU_PERIPHERAL_SCT		:SCT
 * 					- CGU_PERIPHERAL_SCU		:SCU
 * 					- CGU_PERIPHERAL_SDIO		:SDIO
 * 					- CGU_PERIPHERAL_SPIFI		:SPIFI
 * 					- CGU_PERIPHERAL_SSP0		:SSP0
 * 					- CGU_PERIPHERAL_SSP1		:SSP1
 * 					- CGU_PERIPHERAL_TIMER0		:TIMER0
 * 					- CGU_PERIPHERAL_TIMER1		:TIMER1
 * 					- CGU_PERIPHERAL_TIMER2		:TIMER2
 * 					- CGU_PERIPHERAL_TIMER3		:TIMER3
 * 					- CGU_PERIPHERAL_UART0		:UART0
 * 					- CGU_PERIPHERAL_UART1		:UART1
 * 					- CGU_PERIPHERAL_UART2		:UART2
 * 					- CGU_PERIPHERAL_UART3		:UART3
 * 					- CGU_PERIPHERAL_USB0		:USB0
 * 					- CGU_PERIPHERAL_USB1		:USB1
 * 					- CGU_PERIPHERAL_WWDT		:WWDT
 * @param[in]	en status, should be:
 * 					- ENABLE: Enable power
 * 					- DISABLE: Disable power
 * @return 		Configure status, could be:
 * 					- CGU_ERROR_SUCCESS: successful
 * 					- Other: error
 **********************************************************************/
uint32_t CGU_ConfigPWR(CGU_PERIPHERAL_T PPType,  FunctionalState en)
{
    if (PPType >= CGU_PERIPHERAL_WWDT && PPType <= CGU_PERIPHERAL_ADC0) {
        return CGU_ERROR_INVALID_PARAM;
    }

    if (en == DISABLE) { /* Going to disable clock */
        /*Get Reg branch status */
        if (CGU_PERIPHERAL_Info[PPType].RegBranchOffset != 0 &&
                CGU_REG_BRANCH_STATUS(PPType) & 1) {
            CGU_REG_BRANCH_CTRL(PPType) &= ~1; /* Disable branch clock */

            while (CGU_REG_BRANCH_STATUS(PPType) & 1);
        }

