peng-zhihui/L-ink_Card/DAP-Link/Firmware/src/source/hic_hal/nxp/lpc4322/lpc43xx_cgu.c
    } else if (ClockFrequency < 25000000) {
        LPC_CGU->XTAL_OSC_CTRL |= (1 << 2);

    } else {
        return CGU_ERROR_FREQ_OUTOF_RANGE;
    }

    CGU_ClockSourceFrequency[CGU_CLKSRC_XTAL_OSC] = ClockFrequency;
    return CGU_ERROR_SUCCESS;
}


/*********************************************************************//**
 * @brief		Set clock divider
 * @param[in]	SelectDivider	Clock source, should be:
 * 					- CGU_CLKSRC_IDIVA	:Integer divider register A
 * 					- CGU_CLKSRC_IDIVB	:Integer divider register B
 * 					- CGU_CLKSRC_IDIVC	:Integer divider register C
 * 					- CGU_CLKSRC_IDIVD	:Integer divider register D
 * 					- CGU_CLKSRC_IDIVE	:Integer divider register E
 * @param[in]	divisor	Divisor value, should be: 0..255
 * @return 		Setting status, could be:
 * 					- CGU_ERROR_SUCCESS: successful
 * 					- CGU_ERROR_INVALID_ENTITY: Invalid entity
 **********************************************************************/
/* divisor number must >=1*/
uint32_t	CGU_SetDIV(CGU_ENTITY_T SelectDivider, uint32_t divisor)
{
    int32_t RegOffset;
    uint32_t tempReg;

    if (SelectDivider >= CGU_CLKSRC_IDIVA && SelectDivider <= CGU_CLKSRC_IDIVE) {
        RegOffset = CGU_Entity_ControlReg_Offset[SelectDivider];

        if (RegOffset == -1) {
            return CGU_ERROR_INVALID_ENTITY;
        }

        tempReg = CGU_ADDRESS32(LPC_CGU, RegOffset);
        tempReg &= ~(0xFF << 2);
        tempReg |= ((divisor - 1) & 0xFF) << 2;
        CGU_ADDRESS32(LPC_CGU, RegOffset) = tempReg;
        return CGU_ERROR_SUCCESS;
    }

    return CGU_ERROR_INVALID_ENTITY;
}

/*********************************************************************//**
 * @brief		Enable clock entity
 * @param[in]	ClockEntity	Clock entity, should be:
 * 					- CGU_CLKSRC_32KHZ_OSC		:32Khz oscillator
 * 					- CGU_CLKSRC_IRC			:IRC clock
 * 					- CGU_CLKSRC_ENET_RX_CLK	:Ethernet receive clock
 * 					- CGU_CLKSRC_ENET_TX_CLK	:Ethernet transmit clock
 * 					- CGU_CLKSRC_GP_CLKIN		:General purpose input clock
 * 					- CGU_CLKSRC_XTAL_OSC		:Crystal oscillator
 * 					- CGU_CLKSRC_PLL0			:PLL0 clock
 * 					- CGU_CLKSRC_PLL1			:PLL1 clock
 * 					- CGU_CLKSRC_IDIVA			:Integer divider register A
 * 					- CGU_CLKSRC_IDIVB			:Integer divider register B
 * 					- CGU_CLKSRC_IDIVC			:Integer divider register C
 * 					- CGU_CLKSRC_IDIVD			:Integer divider register D
 * 					- CGU_CLKSRC_IDIVE			:Integer divider register E
 * 					- CGU_BASE_SAFE				:Base safe clock (always on)for WDT
 * 					- CGU_BASE_USB0				:Base clock for USB0
 * 					- CGU_BASE_PERIPH			:Base clock for Peripheral bus
 * 					- CGU_BASE_USB1				:Base clock for USB1
 * 					- CGU_BASE_M4				:System base clock for ARM Cortex-M3 core
 * 												 and APB peripheral blocks #0 and #2
 * 					- CGU_BASE_SPIFI			:Base clock for SPIFI
 * 					- CGU_BASE_PHY_RX			:Base clock for Ethernet PHY Rx
 * 					- CGU_BASE_PHY_TX			:Base clock for Ethernet PHY Tx
 * 					- CGU_BASE_APB1				:Base clock for APB peripheral block #1
 * 					- CGU_BASE_APB3				:Base clock for APB peripheral block #3
 * 					- CGU_BASE_LCD				:Base clock for LCD
 * 					- CGU_BASE_SDIO				:Base clock for SDIO card reader
 * 					- CGU_BASE_SSP0				:Base clock for SSP0
 * 					- CGU_BASE_SSP1				:Base clock for SSP1
 * 					- CGU_BASE_UART0			:Base clock for UART0
 * 					- CGU_BASE_UART1			:Base clock for UART1
 * 					- CGU_BASE_UART2			:Base clock for UART2
 * 					- CGU_BASE_UART3			:Base clock for UART3
 * 					- CGU_BASE_CLKOUT			:Base clock for CLKOUT pin
 * @param[in]	en status, should be:
 * 					- ENABLE: Enable power
 * 					- DISABLE: Disable power
 * @return 		Setting status, could be:
 * 					- CGU_ERROR_SUCCESS: successful
 * 					- CGU_ERROR_INVALID_ENTITY: Invalid entity
 **********************************************************************/
uint32_t CGU_EnableEntity(CGU_ENTITY_T ClockEntity, uint32_t en)
{
    int32_t RegOffset;
    int32_t i;

    if (ClockEntity == CGU_CLKSRC_32KHZ_OSC) {
        if (en) {
            LPC_CREG->CREG0 &= ~((1 << 3) | (1 << 2));
            LPC_CREG->CREG0 |= (1 << 1) | (1 << 0);

        } else {
            LPC_CREG->CREG0 &= ~((1 << 1) | (1 << 0));
            LPC_CREG->CREG0 |= (1 << 3);
        }

        for (i = 0; i < 1000000; i++);

    } else if (ClockEntity == CGU_CLKSRC_ENET_RX_CLK) {
        scu_pinmux(0xC , 0 , MD_PLN, FUNC3);

    } else if (ClockEntity == CGU_CLKSRC_ENET_TX_CLK) {
        scu_pinmux(0x1 , 19 , MD_PLN, FUNC0);

    } else if (ClockEntity == CGU_CLKSRC_GP_CLKIN) {
    } else if (ClockEntity == CGU_CLKSRC_TCK) {
    } else if (ClockEntity == CGU_CLKSRC_XTAL_OSC) {
        if (!en) {
            LPC_CGU->XTAL_OSC_CTRL |= CGU_CTRL_EN_MASK;

        } else {
            LPC_CGU->XTAL_OSC_CTRL &= ~CGU_CTRL_EN_MASK;
        }

        /*Delay for stable clock*/
        for (i = 0; i < 1000000; i++);

    } else {
        RegOffset = CGU_Entity_ControlReg_Offset[ClockEntity];

        if (RegOffset == -1) {
            return CGU_ERROR_INVALID_ENTITY;
        }

        if (!en) {
            CGU_ADDRESS32(CGU_CGU_ADDR, RegOffset) |= CGU_CTRL_EN_MASK;

        } else {
            CGU_ADDRESS32(CGU_CGU_ADDR, RegOffset) &= ~CGU_CTRL_EN_MASK;

            /*if PLL is selected check if it is locked */
            if (ClockEntity == CGU_CLKSRC_PLL0) {
                while ((LPC_CGU->PLL0USB_STAT & 1) == 0x0);
            }

            if (ClockEntity == CGU_CLKSRC_PLL0_AUDIO) {
                while ((LPC_CGU->PLL0AUDIO_STAT & 1) == 0x0);
            }

            if (ClockEntity == CGU_CLKSRC_PLL1) {
                while ((LPC_CGU->PLL1_STAT & 1) == 0x0);

                /*post check lock status */
                if (!(LPC_CGU->PLL1_STAT & 1))
                    while (1);
            }
        }
    }

    return CGU_ERROR_SUCCESS;
}

/*********************************************************************//**
 * @brief		Connect entity clock source
 * @param[in]	ClockSource	Clock source, should be:
 * 					- CGU_CLKSRC_32KHZ_OSC		:32Khz oscillator
 * 					- CGU_CLKSRC_IRC			:IRC clock
 * 					- CGU_CLKSRC_ENET_RX_CLK	:Ethernet receive clock
 * 					- CGU_CLKSRC_ENET_TX_CLK	:Ethernet transmit clock
 * 					- CGU_CLKSRC_GP_CLKIN		:General purpose input clock
 * 					- CGU_CLKSRC_XTAL_OSC		:Crystal oscillator
 * 					- CGU_CLKSRC_PLL0			:PLL0 clock
 * 					- CGU_CLKSRC_PLL1			:PLL1 clock
 * 					- CGU_CLKSRC_IDIVA			:Integer divider register A
 * 					- CGU_CLKSRC_IDIVB			:Integer divider register B
 * 					- CGU_CLKSRC_IDIVC			:Integer divider register C
 * 					- CGU_CLKSRC_IDIVD			:Integer divider register D
 * 					- CGU_CLKSRC_IDIVE			:Integer divider register E
 * @param[in]	ClockEntity	Clock entity, should be:
 * 					- CGU_CLKSRC_PLL0			:PLL0 clock
 * 					- CGU_CLKSRC_PLL1			:PLL1 clock
 * 					- CGU_CLKSRC_IDIVA			:Integer divider register A
 * 					- CGU_CLKSRC_IDIVB			:Integer divider register B
 * 					- CGU_CLKSRC_IDIVC			:Integer divider register C
 * 					- CGU_CLKSRC_IDIVD			:Integer divider register D
 * 					- CGU_CLKSRC_IDIVE			:Integer divider register E
 * 					- CGU_BASE_SAFE				:Base safe clock (always on)for WDT
 * 					- CGU_BASE_USB0				:Base clock for USB0
 * 					- CGU_BASE_USB1				:Base clock for USB1
 * 					- CGU_BASE_M4				:System base clock for ARM Cortex-M3 core
 * 												 and APB peripheral blocks #0 and #2
 * 					- CGU_BASE_SPIFI			:Base clock for SPIFI
 * 					- CGU_BASE_PHY_RX			:Base clock for Ethernet PHY Rx
 * 					- CGU_BASE_PHY_TX			:Base clock for Ethernet PHY Tx
 * 					- CGU_BASE_APB1				:Base clock for APB peripheral block #1
 * 					- CGU_BASE_APB3				:Base clock for APB peripheral block #3
 * 					- CGU_BASE_LCD				:Base clock for LCD
 * 					- CGU_BASE_SDIO				:Base clock for SDIO card reader
 * 					- CGU_BASE_SSP0				:Base clock for SSP0
 * 					- CGU_BASE_SSP1				:Base clock for SSP1
 * 					- CGU_BASE_UART0			:Base clock for UART0
 * 					- CGU_BASE_UART1			:Base clock for UART1
 * 					- CGU_BASE_UART2			:Base clock for UART2
 * 					- CGU_BASE_UART3			:Base clock for UART3
 * 					- CGU_BASE_CLKOUT			:Base clock for CLKOUT pin
 * @return 		Setting status, could be:
 * 					- CGU_ERROR_SUCCESS: successful
 * 					- CGU_ERROR_CONNECT_TOGETHER: Error when 2 clock source connect together
 * 					- CGU_ERROR_INVALID_CLOCK_SOURCE: Invalid clock source error
 * 					- CGU_ERROR_INVALID_ENTITY: Invalid entity error
 **********************************************************************/
/* Connect one entity into clock source */
uint32_t CGU_EntityConnect(CGU_ENTITY_T ClockSource, CGU_ENTITY_T ClockEntity)
{
    int32_t RegOffset;
    uint32_t tempReg;

    if (ClockSource > CGU_CLKSRC_IDIVE) {
        return CGU_ERROR_INVALID_CLOCK_SOURCE;
    }

    if (ClockEntity >= CGU_CLKSRC_PLL0 && ClockEntity <= CGU_BASE_CLKOUT) {
        if (CGU_ConnectAlloc_Tbl[ClockSource][ClockEntity]) {
            RegOffset = CGU_Entity_ControlReg_Offset[ClockSource];

            if (RegOffset != -1) {
                if (ClockEntity <= CGU_CLKSRC_IDIVE &&
                        ClockEntity >= CGU_CLKSRC_PLL0) {
                    //RegOffset = (CGU_ADDRESS32(LPC_CGU,RegOffset)>>24)&0xF;
                    if (((CGU_ADDRESS32(LPC_CGU, RegOffset) >> 24) & 0xF) == ClockEntity) {
                        return CGU_ERROR_CONNECT_TOGETHER;
                    }
                }
            }

            RegOffset = CGU_Entity_ControlReg_Offset[ClockEntity];

            if (RegOffset == -1) {
                return CGU_ERROR_INVALID_ENTITY;
            }

