peng-zhihui/L-ink_Card/DAP-Link/Firmware/src/source/hic_hal/nxp/lpc4322/lpc43xx_cgu.c
            tempReg = CGU_ADDRESS32(LPC_CGU, RegOffset);
            tempReg &= ~CGU_CTRL_SRC_MASK;
            tempReg |= ClockSource << 24 | CGU_CTRL_AUTOBLOCK_MASK;
            CGU_ADDRESS32(LPC_CGU, RegOffset) = tempReg;
            return CGU_ERROR_SUCCESS;

        } else {
            return CGU_ERROR_INVALID_CLOCK_SOURCE;
        }

    } else {
        return CGU_ERROR_INVALID_ENTITY;
    }
}


/*********************************************************************//**
 * @brief		Get current USB PLL clock from XTAL
 * @param[in]	None
 * @return 		Returned clock value
 **********************************************************************/
uint32_t CGU_SetPLL0(void)
{
    // Setup PLL550 to generate 480MHz from 12 MHz crystal
    LPC_CGU->PLL0USB_CTRL |= 1; 	// Power down PLL
    //	P			N
    LPC_CGU->PLL0USB_NP_DIV = (98 << 0) | (514 << 12);
    //	SELP	SELI	SELR	MDEC
    LPC_CGU->PLL0USB_MDIV = (0xB << 17) | (0x10 << 22) | (0 << 28) | (0x7FFA << 0);
    LPC_CGU->PLL0USB_CTRL = (CGU_CLKSRC_XTAL_OSC << 24) | (0x3 << 2) | (1 << 4);
    return CGU_ERROR_SUCCESS;
}



/*********************************************************************//**
 * @brief		Get current Audio PLL clock from XTAL
 * @param[in]	None
 * @return 		Returned clock value
 **********************************************************************/
uint32_t CGU_SetPLL0audio(void)
{
    /* disable clock, disable skew enable, power down pll,
    * (dis/en)able post divider, (dis/en)able pre-divider,
    * disable free running mode, disable bandsel,
    * enable up limmiter, disable bypass
    */
    LPC_CGU->PLL0AUDIO_CTRL = (6 << 24)   /* source = XTAL OSC 12 MHz */
                              | _BIT(0); /* power down */
    /* PLL should be set to 512fs rate 512 * 48000 =  24576000 Hz */
    /* set mdec register */
#if 1   	// results from gcc program
    LPC_CGU->PLL0AUDIO_MDIV = 0x23e34d3;
    LPC_CGU->PLL0AUDIO_NP_DIV = 0x3f00e;
    LPC_CGU->PLL0AUDIO_CTRL = (6 << 24)   /* source = XTAL OSC 12 MHz */
                              | (6 << 12)		 // fractional divider off and bypassed
                              | _BIT(4);   /* CLKEN */
#else
    LPC_CGU->PLL0AUDIO_MDIV = (0 << 28)  /* SELR */
                              | (40 << 22)   /* SELI */
                              | (31 << 17)   /* SELP */
                              | 11372;       /* MDEC */
    /* set ndec, pdec register */
    LPC_CGU->PLL0AUDIO_NP_DIV = (22 << 12)       /* ndec */
                                | (10);               /* pdec */
    /* set fraction divider register. [21:15] = m, [14:0] = fractional value */
    LPC_CGU->PLL0AUDIO_FRAC = (86 << 15) | 0x1B7;
    LPC_CGU->PLL0AUDIO_CTRL = (6 << 24)   /* source = XTAL OSC 12 MHz */
                              | _BIT(12)   /* enable SD modulator to update mdec*/
                              | _BIT(4);   /* CLKEN */
#endif

    /* wait for lock */
    while (!(LPC_CGU->PLL0AUDIO_STAT & 1));

    return CGU_ERROR_SUCCESS;
}


/*********************************************************************//**
 * @brief		Setting PLL1
 * @param[in]	mult	Multiple value
 * @return 		Setting status, could be:
 * 					- CGU_ERROR_SUCCESS: successful
 * 					- CGU_ERROR_INVALID_PARAM: Invalid parameter error
 **********************************************************************/
uint32_t	CGU_SetPLL1(uint32_t mult)
{
    uint32_t msel = 0, nsel = 0, psel = 0, pval = 1;
    uint32_t freq;
    uint32_t ClkSrc = (LPC_CGU->PLL1_CTRL & CGU_CTRL_SRC_MASK) >> 24;
    freq = CGU_ClockSourceFrequency[ClkSrc];
    freq *= mult;
    msel = mult - 1;
    LPC_CGU->PLL1_CTRL &= ~(CGU_PLL1_FBSEL_MASK |
                            CGU_PLL1_BYPASS_MASK |
                            CGU_PLL1_DIRECT_MASK |
                            (0x03 << 8) | (0xFF << 16) | (0x03 << 12));

    if (freq < 156000000) {
        //psel is encoded such that 0=1, 1=2, 2=4, 3=8
        while (2 * (pval)*freq < 156000000) {
            psel++;
            pval *= 2;
        }

//		if(2*(pval)*freq > 320000000) {
//			//THIS IS OUT OF RANGE!!!
//			//HOW DO WE ASSERT IN SAMPLE CODE?
//			//__breakpoint(0);
//			return CGU_ERROR_INVALID_PARAM;
//		}
        LPC_CGU->PLL1_CTRL |= (msel << 16) | (nsel << 12) | (psel << 8) | CGU_PLL1_FBSEL_MASK;

    } else if (freq < 320000000) {
        LPC_CGU->PLL1_CTRL |= (msel << 16) | (nsel << 12) | (psel << 8) | CGU_PLL1_DIRECT_MASK | CGU_PLL1_FBSEL_MASK;

    } else {
        return CGU_ERROR_INVALID_PARAM;
    }

    return CGU_ERROR_SUCCESS;
}


/*********************************************************************//**
 * @brief		Get current base status
 * @param[in]	Base	Base type, should be:
 * 					- CGU_BASE_USB0				:Base clock for USB0
 * 					- CGU_BASE_USB1				:Base clock for USB1
 * 					- CGU_BASE_M4				:System base clock for ARM Cortex-M3 core
 * 												 and APB peripheral blocks #0 and #2
 * 					- CGU_BASE_SPIFI			:Base clock for SPIFI
 * 					- CGU_BASE_APB1				:Base clock for APB peripheral block #1
 * 					- CGU_BASE_APB3				:Base clock for APB peripheral block #3
 * 					- CGU_BASE_SDIO				:Base clock for SDIO card reader
 * 					- CGU_BASE_SSP0				:Base clock for SSP0
 * 					- CGU_BASE_SSP1				:Base clock for SSP1
 * 					- CGU_BASE_UART0			:Base clock for UART0
 * 					- CGU_BASE_UART1			:Base clock for UART1
 * 					- CGU_BASE_UART2			:Base clock for UART2
 * 					- CGU_BASE_UART3			:Base clock for UART3
 * @return 		Always return 0
 **********************************************************************/
uint32_t	CGU_GetBaseStatus(CGU_ENTITY_T Base)
{
    switch (Base) {
        /*CCU1*/
        case CGU_BASE_APB3:
            return LPC_CCU1->BASE_STAT & 1;

        case CGU_BASE_APB1:
            return (LPC_CCU1->BASE_STAT >> 1) & 1;

        case CGU_BASE_SPIFI:
            return (LPC_CCU1->BASE_STAT >> 2) & 1;

        case CGU_BASE_M4:
            return (LPC_CCU1->BASE_STAT >> 3) & 1;

        case CGU_BASE_USB0:
            return (LPC_CCU1->BASE_STAT >> 7) & 1;

        case CGU_BASE_USB1:
            return (LPC_CCU1->BASE_STAT >> 8) & 1;

        /*CCU2*/
        case CGU_BASE_UART3:
            return (LPC_CCU2->BASE_STAT >> 1) & 1;

        case CGU_BASE_UART2:
            return (LPC_CCU2->BASE_STAT >> 2) & 1;

        case CGU_BASE_UART1:
            return (LPC_CCU2->BASE_STAT >> 3) & 1;

